'''
# 변수(variable)
    데이터를 저장하는 공간에 이름을 붙임

# 변수 선언과 초기화
    변수명 = 데이터
변수 선언 : 데이터를 저장하는 공간에 변수명을 붙이는 작업
변수 초기화 : 할당 받은 변수공간에 최초로 데이터를 넣는 작업

# 변수명 작명규칙
1. 알파벳, 숫자, 언더바로 구성
2. 대소문자 구분함
3. 공백이나 특수기호 사용불가
4. 숫자로 시작할 수 없음
5. 파이썬 명령어 사용불가 ex) for, break 등
'''

var1 = 10
var2 = 20
sum = var1 + var2
print('sum:', sum)


# 불가능한 변수명
# 2somplace = 20 # 숫자로 시작 X
# n um = 20 # 공백 X
# ten@$ = 20 # 특수기호 X
# for = 20 # 파이썬 명령어 X


# 두 단어의 구분을 대문자 or 언더바(_) 사용
chocoWaffle = '초코와플'
phone_num = '1111'
phone_Num = '2222'
print(phone_num)
print(phone_Num) # 대소문자 구분함



















