'''
# 사칙 연산자
+ : 덧셈 연산자
- : 뺄셈 연산자
* : 곱셈 연산자

/ : 나눗셈 연산자 - 결과는 무조건 실수, 소수자리 포함
% : 나머지 연산자

// : 정수 나누기 연산자 - 소수점 이하 버림(floor)
** : 제곱 연산자
'''

print(10 + 20.5)
print(50 - 30)
print(10 * 50)
print()

print('3 / 2 =', 3 / 2)
print('14 % 3 =', 14 % 3)
print('11 % 3.5 =', 11 % 3.5)
print()

print('3 // 2 =', 3 // 2)
print('4 ** 3 =', 4 ** 3)

print('5 / 4 =', 5 / 4)
print('4 / 2 =', 4 / 2)
print('4 // 2 =', 4 // 2)
print()

# 문자열과 숫자에서 '+', '*' 기호
print('토요일' + '일요일') # 문자열 + 문자열 : 이어붙임
print('일욜' * 3) # 문자열 * 3 : 숫자만큼 문자열을 생성
# print(402 + '호') # 에러
print(True + 10) # True => 1 로 변환 (False = 0)




















